#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.git_net_1.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.git_net_2.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.git_net_1.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.git_net_2.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]]
module.git_net_2.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.git_net_1.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.git_net_1.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.git_net_1.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.git_net_2.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.git_net_2.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.git_net_2.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap]
module.git_net_2.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.git_net_2.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.git_net_1.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.git_net_2.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_1.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_2.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/subnet-[192.168.16.1/24]]
module.git_net_2.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/rsdomAtt-[uni/phys-github_project]]
module.git_net_2.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_16_bd]
module.git_net_2.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]
module.common.data.aci_tenant.common: Reading...
module.git_net_1.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap]
module.common.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]
module.git_net_1.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_15_bd]
module.git_net_1.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]
module.git_net_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]]
module.git_net_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/subnet-[192.168.15.1/24]]
module.git_net_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/rsdomAtt-[uni/phys-github_project]]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.git_net_1.aci_application_epg.github_project has been deleted
  - resource "aci_application_epg" "github_project" {
      - id                     = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg" -> null
        name                   = "git_net_1_epg"
        # (14 unchanged attributes hidden)
    }

  # module.git_net_1.aci_application_profile.github_project has been deleted
  - resource "aci_application_profile" "github_project" {
      - id          = "uni/tn-github_project/ap-git_net_1_ap" -> null
        name        = "git_net_1_ap"
        # (4 unchanged attributes hidden)
    }

  # module.git_net_1.aci_bridge_domain.github_project has been deleted
  - resource "aci_bridge_domain" "github_project" {
      - id                          = "uni/tn-github_project/BD-vlan_15_bd" -> null
        name                        = "vlan_15_bd"
        # (24 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.aci_access_generic.epg_to_aep will be created
  + resource "aci_access_generic" "epg_to_aep" {
      + annotation                          = "orchestrator:terraform"
      + attachable_access_entity_profile_dn = (known after apply)
      + description                         = (known after apply)
      + id                                  = (known after apply)
      + name                                = "default"
      + name_alias                          = (known after apply)
    }

  # module.common.aci_attachable_access_entity_profile.github_project will be created
  + resource "aci_attachable_access_entity_profile" "github_project" {
      + annotation              = "orchestrator:terraform"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "github_project"
      + name_alias              = (known after apply)
      + relation_infra_rs_dom_p = (known after apply)
    }

  # module.common.aci_physical_domain.github_project will be created
  + resource "aci_physical_domain" "github_project" {
      + annotation                         = "orchestrator:terraform"
      + id                                 = (known after apply)
      + name                               = "github_project"
      + name_alias                         = (known after apply)
      + relation_infra_rs_dom_vxlan_ns_def = (known after apply)
      + relation_infra_rs_vlan_ns          = (known after apply)
      + relation_infra_rs_vlan_ns_def      = (known after apply)
    }

  # module.common.aci_ranges.vlan_2_50_range will be created
  + resource "aci_ranges" "vlan_2_50_range" {
      + alloc_mode   = "static"
      + annotation   = "orchestrator:terraform"
      + description  = (known after apply)
      + from         = "vlan-2"
      + id           = (known after apply)
      + name_alias   = (known after apply)
      + role         = (known after apply)
      + to           = "vlan-50"
      + vlan_pool_dn = (known after apply)
    }

  # module.common.aci_tenant.github_project will be created
  + resource "aci_tenant" "github_project" {
      + annotation                    = "orchestrator:terraform"
      + description                   = "Tenant for github_project"
      + id                            = (known after apply)
      + name                          = "github_project"
      + name_alias                    = (known after apply)
      + relation_fv_rs_tenant_mon_pol = (known after apply)
    }

  # module.common.aci_vlan_pool.github_project will be created
  + resource "aci_vlan_pool" "github_project" {
      + alloc_mode  = "static"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "github_project_pool"
      + name_alias  = (known after apply)
    }

  # module.common.aci_vrf.github_project will be created
  + resource "aci_vrf" "github_project" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = "VRF for github_project"
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "github_project"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = (known after apply)
    }

  # module.git_net_1.aci_application_epg.github_project will be created
  + resource "aci_application_epg" "github_project" {
      + annotation                  = "tag_epg"
      + application_profile_dn      = (known after apply)
      + description                 = "EPG for git_net_1"
      + exception_tag               = "0"
      + flood_on_encap              = "disabled"
      + fwd_ctrl                    = (known after apply)
      + has_mcast_source            = "no"
      + id                          = (known after apply)
      + is_attr_based_epg           = "no"
      + match_t                     = "AtleastOne"
      + name                        = "git_net_1_epg"
      + name_alias                  = (known after apply)
      + pc_enf_pref                 = "unenforced"
      + pref_gr_memb                = "exclude"
      + prio                        = "unspecified"
      + relation_fv_rs_bd           = (known after apply)
      + relation_fv_rs_cust_qos_pol = (known after apply)
      + shutdown                    = "no"
    }

  # module.git_net_1.aci_application_profile.github_project will be created
  + resource "aci_application_profile" "github_project" {
      + annotation                = "orchestrator:terraform"
      + description               = "git_net_1 ap"
      + id                        = (known after apply)
      + name                      = "git_net_1_ap"
      + name_alias                = (known after apply)
      + prio                      = (known after apply)
      + relation_fv_rs_ap_mon_pol = (known after apply)
      + tenant_dn                 = (known after apply)
    }

  # module.git_net_1.aci_bridge_domain.github_project will be created
  + resource "aci_bridge_domain" "github_project" {
      + annotation                  = "tag_bd"
      + arp_flood                   = "yes"
      + bridge_domain_type          = "regular"
      + description                 = "Bridge Domain for git_net_1"
      + ep_clear                    = "no"
      + ep_move_detect_mode         = (known after apply)
      + host_based_routing          = "no"
      + id                          = (known after apply)
      + intersite_bum_traffic_allow = "yes"
      + intersite_l2_stretch        = "yes"
      + ip_learning                 = "yes"
      + ipv6_mcast_allow            = (known after apply)
      + limit_ip_learn_to_subnets   = "yes"
      + ll_addr                     = (known after apply)
      + mac                         = (known after apply)
      + mcast_allow                 = "no"
      + multi_dst_pkt_act           = "bd-flood"
      + name                        = "vlan_15_bd"
      + name_alias                  = (known after apply)
      + optimize_wan_bandwidth      = "no"
      + relation_fv_rs_bd_to_ep_ret = (known after apply)
      + relation_fv_rs_bd_to_nd_p   = (known after apply)
      + relation_fv_rs_ctx          = (known after apply)
      + relation_fv_rs_igmpsn       = (known after apply)
      + relation_fv_rs_mldsn        = (known after apply)
      + tenant_dn                   = (known after apply)
      + unicast_route               = (known after apply)
      + unk_mac_ucast_act           = "proxy"
      + unk_mcast_act               = "flood"
      + v6unk_mcast_act             = (known after apply)
      + vmac                        = "not-applicable"
    }

  # module.git_net_1.aci_epg_to_domain.net_2_domain will be created
  + resource "aci_epg_to_domain" "net_2_domain" {
      + allow_micro_seg       = (known after apply)
      + annotation            = "orchestrator:terraform"
      + application_epg_dn    = (known after apply)
      + binding_type          = (known after apply)
      + custom_epg_name       = (known after apply)
      + delimiter             = (known after apply)
      + encap                 = (known after apply)
      + encap_mode            = (known after apply)
      + epg_cos               = (known after apply)
      + epg_cos_pref          = (known after apply)
      + id                    = (known after apply)
      + instr_imedcy          = (known after apply)
      + lag_policy_name       = (known after apply)
      + netflow_dir           = (known after apply)
      + netflow_pref          = (known after apply)
      + num_ports             = (known after apply)
      + port_allocation       = (known after apply)
      + primary_encap         = (known after apply)
      + primary_encap_inner   = (known after apply)
      + res_imedcy            = (known after apply)
      + secondary_encap_inner = (known after apply)
      + switching_mode        = (known after apply)
      + tdn                   = (known after apply)
      + vmm_allow_promiscuous = (known after apply)
      + vmm_forged_transmits  = (known after apply)
      + vmm_id                = (known after apply)
      + vmm_mac_changes       = (known after apply)
    }

  # module.git_net_1.aci_epgs_using_function.epg_to_aep_assign will be created
  + resource "aci_epgs_using_function" "epg_to_aep_assign" {
      + access_generic_dn = (known after apply)
      + annotation        = "orchestrator:terraform"
      + encap             = "vlan-15"
      + id                = (known after apply)
      + instr_imedcy      = (known after apply)
      + mode              = "regular"
      + primary_encap     = (known after apply)
      + tdn               = (known after apply)
    }

  # module.git_net_1.aci_subnet.subnet will be created
  + resource "aci_subnet" "subnet" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = (known after apply)
      + description = "This subnet is created by terraform"
      + id          = (known after apply)
      + ip          = "192.168.15.1/24"
      + name_alias  = (known after apply)
      + parent_dn   = (known after apply)
      + preferred   = "no"
      + scope       = [
          + "public",
          + "shared",
        ]
      + virtual     = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*